In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sivas\anaconda3\lib\site-packages (8.1.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\sivas\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.12)

In [4]:
# import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [5]:
# create connection with server

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [6]:
connection = create_server_connection("localhost", "root", "Sivaprasad@2646")

MySQL Database connection successful

In [7]:
# creating database
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [8]:
create_database_query = 'CREATE DATABASE company'
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'company'; database exists'

In [9]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name  
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [10]:
# to execute operations
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

In [11]:
# creating table

create_employees_table = """
CREATE TABLE employees (
    emp_no INT(11) NOT NULL AUTO_INCREMENT,
    first_name VARCHAR(15) NOT NULL,
    last_name VARCHAR(15) NOT NULL,
    hire_date VARCHAR(15) NOT NULL,
    gender ENUM('M','F') NOT NULL,
    birth_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no)
    );
"""

connection = create_db_connection("localhost", "root", 'Sivaprasad@2646', 'company') # Connect to the Database
execute_query(connection, create_employees_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'employees' already exists'

In [12]:
# department table 
create_departments_table = """
CREATE TABLE departments (
    dept_no VARCHAR(10) NOT NULL,
    dept_name VARCHAR(40) NOT NULL,
    PRIMARY KEY (dept_no), 
    UNIQUE KEY dept_name(dept_name)
    );
"""
connection=create_db_connection("localhost", "root","Sivaprasad@2646","company")
execute_query(connection,create_departments_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'departments' already exists'

In [13]:
# salaries table
create_salaries_table = """
CREATE TABLE salaries (
    emp_no INT(11) NOT NULL,
    salary INT(11) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no,from_date), 
    KEY emp_no (emp_no),
    CONSTRAINT salaries_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES employees (emp_no) ON DELETE CASCADE
    );
"""
connection = create_db_connection("localhost", "root", "Sivaprasad@2646","company")
execute_query(connection,create_salaries_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'salaries' already exists'

In [14]:
create_deptemp_table = """
CREATE TABLE dept_emp (
    emp_no INT(11) NOT NULL,
    dept_no VARCHAR(10) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no, dept_no), 
    KEY emp_no (emp_no),
    KEY dept_no (dept_no),
    CONSTRAINT dept_emp_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES employees (emp_no) ON DELETE CASCADE,
    CONSTRAINT dept_emp_ibfk_2 FOREIGN KEY (dept_no)
        REFERENCES departments (dept_no) ON DELETE CASCADE
);
"""
connection = create_db_connection("localhost", "root", "Sivaprasad@2646","company")
execute_query(connection,create_deptemp_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'dept_emp' already exists'

In [15]:
create_dept_manager_table = """
CREATE TABLE dept_manager (
    emp_no INT(11) NOT NULL,
    dept_no VARCHAR(10) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) NOT NULL,
    PRIMARY KEY (emp_no, dept_no),
    KEY emp_no (emp_no),
    KEY dept_no (dept_no),
    CONSTRAINT dept_manager_ibfk_1 FOREIGN KEY (emp_no) 
        REFERENCES employees (emp_no) ON DELETE CASCADE,
    CONSTRAINT dept_manager_ibfk_2 FOREIGN KEY (dept_no)
        REFERENCES departments (dept_no) ON DELETE CASCADE
    );
"""
connection = create_db_connection("localhost", "root", "Sivaprasad@2646","company")
execute_query(connection,create_dept_manager_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'dept_manager' already exists'

In [17]:
create_titles_table ="""
CREATE TABLE titles (
    emp_no INT(11) NOT NULL,
    title VARCHAR(50) NOT NULL,
    from_date VARCHAR(15) NOT NULL,
    to_date VARCHAR(15) DEFAULT NULL,
    PRIMARY KEY (emp_no,title,from_date), KEY emp_no (emp_no),
    CONSTRAINT titles_ibfk_1 FOREIGN KEY (emp_no)
        REFERENCES employees (emp_no) ON DELETE CASCADE
    );
"""

connection = create_db_connection("localhost", "root", "Sivaprasad@2646", 'company')
execute_query(connection, create_titles_table)

MySQL Database connection successful
Query successful

In [21]:
# inserting values to the tables

pop_employee = """
INSERT INTO employees VALUES
(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14'),
(2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01'), 
(3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01'),
(4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19'),
(5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17'),
(6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21'),
(7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29'),
(8, 'Radha',  'Marathe', '2020-03-29', 'F', '1988-11-22')
"""

connection = create_db_connection("localhost", "root", 'Sivaprasad@2646', 'company')
execute_query(connection, pop_employee)

MySQL Database connection successful
Query successful

In [22]:
from datetime import datetime,date

In [23]:
# inserting values to departments table
pop_dept = """
INSERT INTO departments VALUES
('HR01', 'Human Resources'),
('SFT01', 'S.Development'),
('SFT02', 'S.Testing'),
('MKT01', 'Marketing')
"""
connection = create_db_connection('localhost','root', 'Sivaprasad@2646','company')
execute_query(connection, pop_dept)

MySQL Database connection successful
Query successful

In [24]:
# inserting values to manager table

pop_manager = """
INSERT INTO dept_manager VALUES
(2, 'SFT01','2008-12-20','2012-03-19'),
(3, 'MKT01', '2014-06-11', '2020-10-04'),
(6, 'SFT02', '2002-04-07','2004-11-10'),
(8, 'HR01', '2020-03-29','2022-03-03')

"""
connction = create_db_connection('localhost', 'root', 'Sivaprasad@2646', 'company')
execute_query(connection, pop_manager)

MySQL Database connection successful
Query successful

In [25]:
# inserting values to title table

pop_title = """
INSERT INTO titles VALUES
(1,'Sr.Soft.Developer','2002-12-06', '2007-07-18'),
(2,'Soft.Developer Mngr.','2008-12-20', '2012-03-19'),
(3,'Marketing Mngr','2014-06-11', '2020-10-04'),
(4,'Soft.Tester','2000-08-23', '2005-12-03'),
(5,'HR Staff','2020-03-30','2021-10-09'),
(6,'Soft.Tester Mngr','2002-12-06','2004-11-10'),
(7,'Marketing Staff','2014-06-11','2016-12-04'),
(8,'HR Manager','2020-03-29','2022-03-03')
"""

connection = create_db_connection('localhost', 'root', 'Sivaprasad@2646','company')
execute_query(connection, pop_title)

MySQL Database connection successful
Query successful

In [26]:
# inserting values in the form of lists
def execute_list_query(connection, sql, val):
    cursor = connection.cursor()
    try:
        cursor.executemany(sql, val)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

In [29]:
# inserting values to salary table in the form of list

pop_salary = """INSERT INTO salaries (emp_no, salary, from_date, to_date) VALUES (%s, %s, %s, %s)"""

today = datetime.now().date()

sal_data = [(1, 1234567, '1999-02-20', today.isoformat()),
(2, 2345678, '2007-11-08', today.isoformat()),
(3, 3456789, '2014-06-11', today.isoformat()),
(4, 4567890, '2000-08-23', today.isoformat()),
(5, 5678901, '2020-03-30', today.isoformat()),
(6, 6789012, '1999-02-21', today.isoformat()),
(7, 7890123, '2014-06-11', today.isoformat()),
(8, 8901234, '2020-03-29', today.isoformat())]

connection = create_db_connection('localhost' , 'root', 'Sivaprasad@2646', 'company')
execute_list_query(connection, pop_salary, sal_data)

MySQL Database connection successful
Query successful

In [34]:
pop_deptemp = """INSERT INTO dept_emp (emp_no, dept_no, from_date, to_date) VALUES (%s, %s, %s, %s)"""

deptemp_data = [(1, 'SFT01','1999-02-20', today.isoformat()),
(2, 'SFT01','2007-11-08',today.isoformat()),
(3, 'MKT01','2014-06-11',today.isoformat()),
(4, 'SFT02','2000-08-23',today.isoformat()),
(5, 'HR01','2020-03-30',today.isoformat()),
(6, 'SFT02','1999-02-21',today.isoformat()),
(7, 'MKT01','2014-06-11',today.isoformat()),
(8, 'HR01','2020-03-29',today.isoformat())]

connection =create_db_connection('localhost', 'root', 'Sivaprasad@2646', 'company')
execute_list_query(connection, pop_deptemp, deptemp_data)

MySQL Database connection successful
Error: '1062 (23000): Duplicate entry '1-SFT01' for key 'dept_emp.PRIMARY''

In [39]:
# Reading data

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result 
    except Error as err:
        print(f"Error: '{err}'" )

In [41]:
r1="""
select * from employees;
"""
connection = create_db_connection('localhost','root','Sivaprasad@2646','company')
results = read_query(connection,r1)
results

MySQL Database connection successful

[(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14'),
 (2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01'),
 (3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01'),
 (4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19'),
 (5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17'),
 (6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21'),
 (7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29'),
 (8, 'Radha', 'Marathe', '2020-03-29', 'F', '1988-11-22')]

In [42]:
for result in results:
    print(result)

(1, 'Raju', 'Rathi', '1999-02-20', 'M', '1977-06-14')
(2, 'Shyam', 'Naik', '2007-11-08', 'M', '1985-11-01')
(3, 'Baburao', 'Apte', '2014-06-11', 'M', '1984-02-01')
(4, 'Anjali', 'Pande', '2000-08-23', 'F', '1978-05-19')
(5, 'Abhilasha', 'Mohite', '2020-03-30', 'F', '1994-01-17')
(6, 'Suresh', 'Kadam', '1999-02-21', 'M', '1977-08-21')
(7, 'Manish', 'Joshi', '2014-06-11', 'M', '1992-09-29')
(8, 'Radha', 'Marathe', '2020-03-29', 'F', '1988-11-22')

In [49]:
r2 = """
select first_name , last_name from employees;
"""
connection = create_db_connection('localhost','root','Sivaprasad@2646','company')
results = read_query(connection,r2)
results

MySQL Database connection successful

[('Raju', 'Rathi'),
 ('Shyam', 'Naik'),
 ('Baburao', 'Apte'),
 ('Anjali', 'Pande'),
 ('Abhilasha', 'Mohite'),
 ('Suresh', 'Kadam'),
 ('Manish', 'Joshi'),
 ('Radha', 'Marathe')]

In [53]:
r3 = """
select employees.first_name, employees.last_name from employees join dept_manager on employees.emp_no = dept_manager.emp_no;
"""
connection = create_db_connection('localhost','root','Sivaprasad@2646','company')
results = read_query(connection,r3)
results

MySQL Database connection successful

[('Shyam', 'Naik'),
 ('Baburao', 'Apte'),
 ('Suresh', 'Kadam'),
 ('Radha', 'Marathe')]

In [56]:
r4 = """
SELECT employees.first_name, dept_emp.dept_no FROM  employees JOIN dept_emp ON employees.emp_no = dept_emp.emp_no;

"""

connection = create_db_connection('localhost','root','Sivaprasad@2646','company')
results = read_query(connection,r4)
results

MySQL Database connection successful

[('Raju', 'SFT01'),
 ('Shyam', 'SFT01'),
 ('Baburao', 'MKT01'),
 ('Anjali', 'SFT02'),
 ('Abhilasha', 'HR01'),
 ('Suresh', 'SFT02'),
 ('Manish', 'MKT01'),
 ('Radha', 'HR01')]

In [62]:
r5 = """
SELECT employees.first_name, salaries.salary FROM employees JOIN salaries ON employees.emp_no = salaries.emp_no;

"""

connection = create_db_connection('localhost','root','Sivaprasad@2646','company')
results = read_query(connection,r5)
results

MySQL Database connection successful

[('Raju', 1234567),
 ('Shyam', 2345678),
 ('Baburao', 3456789),
 ('Anjali', 4567890),
 ('Abhilasha', 5678901),
 ('Suresh', 6789012),
 ('Manish', 7890123),
 ('Radha', 8901234)]

In [71]:
import pandas as pd 
columns = [ 'first_name', 'salary']
df = pd.DataFrame(results, columns = columns)
df.tail()

  first_name   salary
3     Anjali  4567890
4  Abhilasha  5678901
5     Suresh  6789012
6     Manish  7890123
7      Radha  8901234